cmsis-svd/cmsis-svd/data/Atmel/ATSAMV71Q19B.svd
            <register>
               <name>USBHS_TSTA1</name>
               <description>General Test A1 Register</description>
               <addressOffset>0x0810</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CounterA</name>
                     <description>Counter A</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
                  <field>
                     <name>LoadCntA</name>
                     <description>Load CounterA</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CounterB</name>
                     <description>Counter B</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>LoadCntB</name>
                     <description>Load CounterB</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOFCntMa1</name>
                     <description>SOF Counter Max</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>LoadSOFCnt</name>
                     <description>Load SOF Counter</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBHS_TSTA2</name>
               <description>General Test A2 Register</description>
               <addressOffset>0x0814</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FullDetachEn</name>
                     <description>Full Detach Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSSerialMode</name>
                     <description>HS Serial Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LoopBackMode</name>
                     <description>Loop-back Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DisableGatedClock</name>
                     <description>Disable Gated Clock</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ForceSuspendMTo1</name>
                     <description>Force SuspendM to 1</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ByPassDpll</name>
                     <description>Bypass DPLL</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HostHSDisconnectDisable</name>
                     <description>Host HS Disconnect Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ForceHSRst_50ms</name>
                     <description>Force HS Reset to 50 ms</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RemovePUWhenTX</name>
                     <description>Remove Pull-up When TX</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBHS_VERSION</name>
               <description>General Version Register</description>
               <addressOffset>0x0818</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>VERSION</name>
                     <description>Version Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>MFN</name>
                     <description>Metal Fix Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBHS_FSM</name>
               <description>General Finite State Machine Register</description>
               <addressOffset>0x082C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DRDSTATE</name>
                     <description>Dual Role Device State</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>A_IDLESTATE</name>
                           <description>This is the start state for A-devices (when the ID pin is 0)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>A_WAIT_VRISE</name>
                           <description>In this state, the A-device waits for the voltage on VBus to rise above the A-device VBus Valid threshold (4.4 V).</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>A_WAIT_BCON</name>
                           <description>In this state, the A-device waits for the B-device to signal a connection.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>A_HOST</name>
                           <description>In this state, the A-device that operates in Host mode is operational.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>A_SUSPEND</name>
                           <description>The A-device operating as a host is in the Suspend mode.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>A_PERIPHERAL</name>
                           <description>The A-device operates as a peripheral.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>A_WAIT_VFALL</name>
                           <description>In this state, the A-device waits for the voltage on VBus to drop below the A-device Session Valid threshold (1.4 V).</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>A_VBUS_ERR</name>
                           <description>In this state, the A-device waits for recovery of the over-current condition that caused it to enter this state.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>A_WAIT_DISCHARGE</name>
                           <description>In this state, the A-device waits for the data USB line to discharge (100 us).</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>B_IDLE</name>
                           <description>This is the start state for B-device (when the ID pin is 1).</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>B_PERIPHERAL</name>
                           <description>In this state, the B-device acts as the peripheral.</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>B_WAIT_BEGIN_HNP</name>
                           <description>In this state, the B-device is in Suspend mode and waits until 3 ms before initiating the HNP protocol if requested.</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>B_WAIT_DISCHARGE</name>
                           <description>In this state, the B-device waits for the data USB line to discharge (100 us)) before becoming Host.</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>B_WAIT_ACON</name>
                           <description>In this state, the B-device waits for the A-device to signal a connect before becoming B-Host.</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>B_HOST</name>
                           <description>In this state, the B-device acts as the Host.</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>B_SRP_INIT</name>
                           <description>In this state, the B-device attempts to start a session using the SRP protocol.</description>
                           <value>0xF</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
